# Eleman İşlemleri 2

In [63]:
import numpy as np
import pandas as pd

In [64]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [65]:
s1

array([5, 3, 0, 2, 4])

In [66]:
s2

array([3, 3, 7, 3, 6])

In [67]:
s3

array([4, 4, 3, 4, 7])

In [68]:
sozluk = {
    "var1":s1,
    "var2":s2,
    "var3":s3
}
sozluk

{'var1': array([5, 3, 0, 2, 4]),
 'var2': array([3, 3, 7, 3, 6]),
 'var3': array([4, 4, 3, 4, 7])}

In [69]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     5     3     4
1     3     3     4
2     0     7     3
3     2     3     4
4     4     6     7

In [70]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [71]:
df.index = ["a", "b", "c", "d", "e"]
df

   var1  var2  var3
a     5     3     4
b     3     3     4
c     0     7     3
d     2     3     4
e     4     6     7

In [72]:
df[0:1]

   var1  var2  var3
a     5     3     4

In [73]:
df[0:2]

   var1  var2  var3
a     5     3     4
b     3     3     4

In [74]:
df[1:3]

   var1  var2  var3
b     3     3     4
c     0     7     3

In [75]:
df[1:3]

   var1  var2  var3
b     3     3     4
c     0     7     3

In [76]:
df["a":"d"]

   var1  var2  var3
a     5     3     4
b     3     3     4
c     0     7     3
d     2     3     4

In [77]:
df["var1"]

a    5
b    3
c    0
d    2
e    4
Name: var1, dtype: int32

# Silme İşlemi

In [78]:
df.drop("a", axis=0)

   var1  var2  var3
b     3     3     4
c     0     7     3
d     2     3     4
e     4     6     7

In [79]:
df

   var1  var2  var3
a     5     3     4
b     3     3     4
c     0     7     3
d     2     3     4
e     4     6     7

In [80]:
df.drop("var1", axis=1)

   var2  var3
a     3     4
b     3     4
c     7     3
d     3     4
e     6     7

In [81]:
df

   var1  var2  var3
a     5     3     4
b     3     3     4
c     0     7     3
d     2     3     4
e     4     6     7

In [82]:
df.drop("a", axis=0, inplace=True) # inplace parametresi ile seri üzerinde jakucu sşkne şlkenş yapabiliriz.

In [83]:
df

   var1  var2  var3
b     3     3     4
c     0     7     3
d     2     3     4
e     4     6     7

In [84]:
# Fancy ile birden fazla index veya kolonu tek seferde silme.

In [85]:
l = ["b", "c"]
df.drop(l, axis=0)

   var1  var2  var3
d     2     3     4
e     4     6     7

In [86]:
df

   var1  var2  var3
b     3     3     4
c     0     7     3
d     2     3     4
e     4     6     7

In [87]:
df.drop(l, axis=0, inplace=True)

In [88]:
df

   var1  var2  var3
d     2     3     4
e     4     6     7

In [89]:
c = ["var1", "var2"]
df.drop(c, axis=1)

   var3
d     4
e     7

In [90]:
df

   var1  var2  var3
d     2     3     4
e     4     6     7

In [91]:
df.drop(c, axis=1, inplace=True)

In [92]:
df

   var3
d     4
e     7

In [93]:
yeni = np.random.randint(15, size=(3, 5))
df = pd.DataFrame(yeni, index=["index1", "index2", "index3"],
                  columns=["c1", "c2", "c3", "c4", "c5"])
df

        c1  c2  c3  c4  c5
index1   0   7  10   7   6
index2   7   0   6   3  12
index3   2  13  14   7   1

In [94]:
liste = ["c1", "d2", "e4", "c5"]
liste

['c1', 'd2', 'e4', 'c5']

In [95]:
for element in liste:
    print(element in df)

True
False
False
True

In [96]:
for elemenet in liste:
    if element in df:
        print("True")
    else:
        print("False")

True
True
True
True

In [97]:
liste2 = ["index1", "index2", "index12"]
liste2

['index1', 'index2', 'index12']

In [98]:
for element in liste2:
    print(element in df)

False
False
False

In [99]:
df

        c1  c2  c3  c4  c5
index1   0   7  10   7   6
index2   7   0   6   3  12
index3   2  13  14   7   1

In [100]:
df["c5"] = df["c4"] * df["c2"]

In [101]:
df

        c1  c2  c3  c4  c5
index1   0   7  10   7  49
index2   7   0   6   3   0
index3   2  13  14   7  91

In [102]:
df = pd.DataFrame(np.random.randint(1, 10, 4), index=["index1", "index2", "index3", "index4"], columns=["kolon1"])
df

        kolon1
index1       5
index2       3
index3       7
index4       3

In [103]:
help(df.drop)

Help on method drop in module pandas.core.frame:

drop(labels=None, axis: 'Axis' = 0, index=None, columns=None, level: 'Level | None' = None, inplace: 'bool' = False, errors: 'str' = 'raise') method of pandas.core.frame.DataFrame instance
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by specifying directly index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level. See the `user guide <advanced.shown_levels>`
    for more information about the now unused levels.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop. A tuple will be used as a single
        label and not treated as a list-like.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index : single label or list-like
        Alternative to specifying axis (``labels, axis=0``
        is equivalent to ``index=labels``).
    columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If False, return a copy. Otherwise, do operation
        inplace and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    DataFrame or None
        DataFrame without the removed index or column labels or
        None if ``inplace=True``.

    Raises
    ------
    KeyError
        If any of the labels is not found in the selected axis.

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3, 0.2]])
    >>> df
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    Drop a specific index combination from the MultiIndex
    DataFrame, i.e., drop the combination ``'falcon'`` and
    ``'weight'``, which deletes only the corresponding row

    >>> df.drop(index=('falcon', 'weight'))
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    lama    speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

In [104]:
df

        kolon1
index1       5
index2       3
index3       7
index4       3

In [105]:
df.drop(index=["index1"])

        kolon1
index2       3
index3       7
index4       3

In [106]:
df

        kolon1
index1       5
index2       3
index3       7
index4       3

In [107]:
df.drop(index=["index1", "index2"])

        kolon1
index3       7
index4       3

In [108]:
df

        kolon1
index1       5
index2       3
index3       7
index4       3

In [109]:
df.drop(columns=["kolon1"], index=["index1"])

Empty DataFrame
Columns: []
Index: [index2, index3, index4]

In [110]:
df

        kolon1
index1       5
index2       3
index3       7
index4       3

In [111]:
df.drop(["index1"], axis=0)

        kolon1
index2       3
index3       7
index4       3

In [112]:
df

        kolon1
index1       5
index2       3
index3       7
index4       3

In [113]:
df.drop(index=["index1", "index2"])

        kolon1
index3       7
index4       3

In [119]:
copy_df = df.drop(index=["index1", "index2"], inplace=True)

In [120]:
copy_df

In [121]:
df

        kolon1
index3       7
index4       3

In [126]:
#help(df.copy())

In [130]:
yeni_df = pd.DataFrame(np.random.randint(1, 20, 5), index=["index1", "index2", "index3", "index4", "index5"], columns=["kolon1"])
yeni_df

        kolon1
index1       9
index2      15
index3      19
index4      17
index5       6

In [133]:
copy_df = yeni_df[0:2]
copy_df

        kolon1
index1       9
index2      15

In [135]:
new_df = yeni_df.drop(index=["index1", "index2"])
new_df

        kolon1
index3      19
index4      17
index5       6

In [136]:
deneme = new_df.copy()

In [140]:
type(deneme)

pandas.core.frame.DataFrame

In [146]:
#new_df.drop(index=["index5"], inplace=True)

In [145]:
new_df

        kolon1
index3      19
index4      17

In [147]:
deneme

        kolon1
index3      19
index4      17
index5       6